# Declear Variables

In [16]:
Names =["Ann", "Jane", "Joan", "Clare", "Elizabeth", "Charles", "Jude", "James", "kelvin", "Prosper"]
Age =[14, 16, 14, 17, 16, 16, 17, 14, 15, 18]
Height =[5.5, 6.0, 5.4, 5.9, 5.6, 5.7, 5.9, 5.8, 6.1, 5.9]
Scores =[80, 85, 70, 60, 76, 85, 74, 87, 75, 68]

# Step2: Create a dictionary object containing the observations

In [17]:
tab = {'Names' : Names, 'Age' : Age, 'Height' :Height, 'Scores' : Scores}

In [18]:
tab

{'Names': ['Ann',
  'Jane',
  'Joan',
  'Clare',
  'Elizabeth',
  'Charles',
  'Jude',
  'James',
  'kelvin',
  'Prosper'],
 'Age': [14, 16, 14, 17, 16, 16, 17, 14, 15, 18],
 'Height': [5.5, 6.0, 5.4, 5.9, 5.6, 5.7, 5.9, 5.8, 6.1, 5.9],
 'Scores': [80, 85, 70, 60, 76, 85, 74, 87, 75, 68]}

In [27]:
import pandas as pan

In [28]:
dir(pandas)

NameError: name 'pandas' is not defined

In [22]:
tab = pan.DataFrame(tab)

In [23]:
tab

       Names  Age  Height  Scores
0        Ann   14     5.5      80
1       Jane   16     6.0      85
2       Joan   14     5.4      70
3      Clare   17     5.9      60
4  Elizabeth   16     5.6      76
5    Charles   16     5.7      85
6       Jude   17     5.9      74
7      James   14     5.8      87
8     kelvin   15     6.1      75
9    Prosper   18     5.9      68